content_retrieveSubscriber.xml

<soapenv:Envelope xmlns:ccws="http://comverse-in.com/prepaid/ccws" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-28152406" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>${username}</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">${password}</wsse:Password>
            <wsse:Nonce>Cp1iQZD3r0oCnA7GePVaHA==</wsse:Nonce>
            <wsu:Created>${date}</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
      <ccws:VersionInfoHeader>
         <!--Optional:-->
         <ccws:ProductVersion/>
         <!--Optional:-->
         <ccws:CustomerVersion/>
      </ccws:VersionInfoHeader>
   </soapenv:Header>
    <soapenv:Body>
	  <ccws:RetrieveSubscriberLite>
         <!--Optional:-->
         <ccws:subscriberID>${suscriberID}</ccws:subscriberID>
         <!--Optional:-->
         <ccws:identity/>
      </ccws:RetrieveSubscriberLite>
   </soapenv:Body>
</soapenv:Envelope>